#"""Обособляет каждое целое число кавычками, добавляя кавычку до и после элемента
#       списка, являющегося числом, и дополняет нулём до двух целочисленных разрядов.
#Формирует из списка результирующую строковую переменную и возвращает."""
#def convert_list_in_str(list_in: list) -> str:
#    for elem in my_list:
#        if elem
#    str_out = #"здесь полученная после всех преобразования строковая переменная"
 #   return str_out


my_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
#result = convert_list_in_str(my_list)
#print(result)